Tekla Open API Reference for Tekla Structures 2025
Events.CommandStatusChangeDelegate Delegate
 The delegate to use for command status change.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void CommandStatusChangeDelegate(
	string TSCommand,
	string TSCommandParam,
	bool Status
)
Public Delegate Sub CommandStatusChangeDelegate (
	TSCommand As String,
	TSCommandParam As String,
	Status As Boolean
)
Parameters
TSCommand
Type: System.String
TSCommandParam
Type: System.String
Status
Type: System.Boolean
See Also
Reference
Tekla.Structures.Model Namespace